{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ecff0c79-4f88-4d04-b8b4-dc22392ce04b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# This notebook writes data to the Neo4j graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "fb402506-513d-4951-9e32-9c4ee2ae6d73",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9823c640-f731-4c6a-a148-541e26f3da55",
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"bolt://localhost:7687/\"\n",
    "user = \"neo4j\"\n",
    "password = \"password\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "454ef02d-622f-4e2d-8dba-021701100103",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(user, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "3e7653e8-2867-4724-96c9-484921a99dcd",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database='brainwave')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "f3a3dbbb-01e0-4844-b6e4-84d6ef0c276c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ed91450690>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# loading phone nodes into graph; csv needs to be in graph's import folder\n",
    "session.run(\n",
    "    '''LOAD CSV WITH HEADERS FROM 'file:///phone_nodes.csv' AS row\n",
    "    WITH row\n",
    "    CALL {\n",
    "        WITH row\n",
    "        CREATE (:Identifier {\n",
    "            identifier: row.identifier,\n",
    "            type: row.type\n",
    "            })\n",
    "    };''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "c9c338cc-83fc-4fd6-8255-3c4bcb2f59d9",
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "{neo4j_code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent index already exists, 'Index( id=2, name='identifier_range_index', type='RANGE', schema=(:Identifier {identifier, type}), indexProvider='range-1.0' )'.} {gql_status: 22N70} {gql_status_description: error: data exception - equivalent index already exists. An equivalent index already exists: 'identifier_range_index'}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mClientError\u001b[39m                               Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[5]\u001b[39m\u001b[32m, line 2\u001b[39m\n\u001b[32m      1\u001b[39m \u001b[38;5;66;03m# create an index for phone identifiers\u001b[39;00m\n\u001b[32m----> \u001b[39m\u001b[32m2\u001b[39m \u001b[43msession\u001b[49m\u001b[43m.\u001b[49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m      3\u001b[39m \u001b[38;5;250;43m    \u001b[39;49m\u001b[33;43;03m'''CREATE INDEX identifier_range_index FOR (i:Identifier) ON (i.identifier, i.type);'''\u001b[39;49;00m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:320\u001b[39m, in \u001b[36mSession.run\u001b[39m\u001b[34m(self, query, parameters, **kwargs)\u001b[39m\n\u001b[32m    318\u001b[39m bookmarks = \u001b[38;5;28mself\u001b[39m._get_bookmarks()\n\u001b[32m    319\u001b[39m parameters = \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, **kwargs)\n\u001b[32m--> \u001b[39m\u001b[32m320\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_auto_result\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    321\u001b[39m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    322\u001b[39m \u001b[43m    \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    323\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    324\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    325\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    326\u001b[39m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    327\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    328\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mnotifications_disabled_classifications\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    329\u001b[39m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    331\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m._auto_result\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:237\u001b[39m, in \u001b[36mResult._run\u001b[39m\u001b[34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[39m\n\u001b[32m    235\u001b[39m \u001b[38;5;28mself\u001b[39m._pull()\n\u001b[32m    236\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m237\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:439\u001b[39m, in \u001b[36mResult._attach\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    437\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m    438\u001b[39m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m._attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m439\u001b[39m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_connection\u001b[49m\u001b[43m.\u001b[49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:192\u001b[39m, in \u001b[36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    190\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34minner\u001b[39m(*args, **kwargs):\n\u001b[32m    191\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m192\u001b[39m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43m*\u001b[49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    193\u001b[39m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[32m    194\u001b[39m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio.iscoroutinefunction(\u001b[38;5;28mself\u001b[39m.__on_error)\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:866\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    862\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    863\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    864\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    865\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m866\u001b[39m res = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    867\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    868\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:1202\u001b[39m, in \u001b[36mBolt5x7._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m   1200\u001b[39m \u001b[38;5;28mself\u001b[39m._enrich_error_diagnostic_record(summary_metadata)\n\u001b[32m   1201\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m-> \u001b[39m\u001b[32m1202\u001b[39m     \u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m   1203\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m   1204\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32mc:\\Users\\syast\\Documents\\coding_projects\\neo4j-llm\\neo4j-experiment-main\\neo4j_env\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:262\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    260\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    261\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m262\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mClientError\u001b[39m: {neo4j_code: Neo.ClientError.Schema.EquivalentSchemaRuleAlreadyExists} {message: An equivalent index already exists, 'Index( id=2, name='identifier_range_index', type='RANGE', schema=(:Identifier {identifier, type}), indexProvider='range-1.0' )'.} {gql_status: 22N70} {gql_status_description: error: data exception - equivalent index already exists. An equivalent index already exists: 'identifier_range_index'}"
     ]
    }
   ],
   "source": [
    "# create an index for phone identifiers\n",
    "session.run(\n",
    "    '''CREATE INDEX identifier_range_index FOR (i:Identifier) ON (i.identifier, i.type);''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "00f6f602-ed9c-409d-81d4-572439de51b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1da5b628830>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# loading phone relationships into graph\n",
    "session.run(\n",
    "    '''LOAD CSV WITH HEADERS FROM 'file:///phone_relationships_v1.csv' AS row\n",
    "    WITH row\n",
    "    CALL {\n",
    "        WITH row\n",
    "        MATCH (a:Identifier), (b:Identifier) WHERE a.identifier = row.source and b.identifier = row.target\n",
    "        and a.type = row.source_type and b.type = row.target_type\n",
    "        MERGE (a)-[:CONTACT {first_seen:row.first_seen, last_seen:row.last_seen, times:row.times, collection:row.collection}]->(b)\n",
    "    };''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "a3313eff-b6eb-4da5-a200-a6c92cbed1f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL (row) { ... }', position=<SummaryInputPosition line=3, column=5, offset=88>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 88, 'line': 3, 'column': 5}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"LOAD CSV WITH HEADERS FROM 'file:///phone_relationships_v1.csv' AS row\\n    WITH row\\n    CALL {\\n        WITH row\\n        MATCH (a:Identifier), (b:Identifier) WHERE a.identifier = row.source and b.identifier = row.target\\n        and a.type = row.source_type and b.type = row.target_type\\n        MERGE (a)-[:CONTACT {first_seen:row.first_seen, last_seen:row.last_seen, times:row.times, collection:row.collection}]->(b)\\n    };\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1da5b58ac10>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# loading person nodes into graph; csv needs to be in graph's import folder\n",
    "session.run(\n",
    "    '''LOAD CSV WITH HEADERS FROM 'file:///users.csv' AS row\n",
    "    WITH row\n",
    "    CALL {\n",
    "        WITH row\n",
    "        CREATE (:Person {\n",
    "            first_name: row.first_name,\n",
    "            last_name: row.last_name,\n",
    "            full_name: row.full_name,\n",
    "            birthday: row.birthday\n",
    "            })\n",
    "    };''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4d58a948-9ce7-40ad-8d69-53e4aa28679b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL (row) { ... }', position=<SummaryInputPosition line=3, column=5, offset=71>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 71, 'line': 3, 'column': 5}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"LOAD CSV WITH HEADERS FROM 'file:///users.csv' AS row\\n    WITH row\\n    CALL {\\n        WITH row\\n        CREATE (:Person {\\n            first_name: row.first_name,\\n            last_name: row.last_name,\\n            full_name: row.full_name,\\n            birthday: row.birthday\\n            })\\n    };\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1da5b58b250>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run('''CREATE INDEX person_index FOR (n:Person) ON (n.birthday, n.full_name)''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2481f1bc-64b4-4b5c-943d-476502cf67b8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1da5b58b750>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# loading user-phone relationships into graph\n",
    "session.run(\n",
    "    '''LOAD CSV WITH HEADERS FROM 'file:///phones_users_v1.csv' AS row\n",
    "    WITH row\n",
    "    CALL {\n",
    "        WITH row\n",
    "        MATCH (p:Person), (i:Identifier) WHERE p.full_name = row.full_name AND p.birthday = row.birthday\n",
    "        AND i.identifier = row.identifier AND i.type = row.type\n",
    "        MERGE (p)-[:USER_OF {collection: row.collection}]->(i)\n",
    "    };''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d11f63b2-0d9f-4de0-a3a8-cecb05662cc9",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL (row) { ... }', position=<SummaryInputPosition line=3, column=5, offset=81>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 81, 'line': 3, 'column': 5}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"LOAD CSV WITH HEADERS FROM 'file:///phones_users_v1.csv' AS row\\n    WITH row\\n    CALL {\\n        WITH row\\n        MATCH (p:Person), (i:Identifier) WHERE p.full_name = row.full_name AND p.birthday = row.birthday\\n        AND i.identifier = row.identifier AND i.type = row.type\\n        MERGE (p)-[:USER_OF {collection: row.collection}]->(i)\\n    };\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1da5b58b890>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# update comms relation with new comms\n",
    "session.run(\n",
    "    '''LOAD CSV WITH HEADERS FROM 'file:///new_comms_update.csv' AS row\n",
    "    WITH row\n",
    "    CALL {\n",
    "    WITH row\n",
    "    MATCH (a:Identifier),(b:Identifier) WHERE a.identifier = row.source AND b.identifier = row.target\n",
    "    MERGE (a)-[c1:CONTACT]->(b)\n",
    "    ON CREATE SET c1.last_seen = row.last_seen,c1.times = row.times,c1.first_seen=row.first_seen,c1.collection=row.collection\n",
    "    ON MATCH SET c1.last_seen = row.last_seen,c1.times = row.times\n",
    "};''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2af7f0f3-3649-460d-8577-23f7021e23fe",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8a59df13",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(url=uri,username=user, password=password, database='brainwave')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f7a36285",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Identifier {identifier: STRING, type: STRING}\n",
      "Person {birthday: STRING, first_name: STRING, full_name: STRING, last_name: STRING}\n",
      "Relationship properties:\n",
      "CONTACT {collection: STRING, first_seen: STRING, last_seen: STRING, times: STRING}\n",
      "USER_OF {collection: STRING}\n",
      "The relationships:\n",
      "(:Identifier)-[:CONTACT]->(:Identifier)\n",
      "(:Person)-[:USER_OF]->(:Identifier)\n"
     ]
    }
   ],
   "source": [
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c20f92d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_openai import ChatOpenAI"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "03d6cf15",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOpenAI(\n",
    "    model=\"ai/phi4:latest\",\n",
    "    base_url=\"http://127.0.0.1:12434/engines/v1\",\n",
    "    api_key=\"ignored\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "001c64fb",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d09924bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "prompt = ChatPromptTemplate.from_template(\"\"\"\n",
    "You are an expert Neo4j developer. Use the following database schema to write\n",
    "a Cypher statement to answer the user's question...\n",
    "\n",
    "Schema: {schema}\n",
    "Question: {question}\"\"\", partial_variables={'schema':graph.schema})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e4d4a55d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.output_parsers import StrOutputParser"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "3296c7b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_chain = prompt | llm | StrOutputParser"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "d9bf9d10",
   "metadata": {},
   "outputs": [],
   "source": [
    "formatted_prompt = prompt.invoke({\"question\": \"Which phones were in contact with phone 84795203656?\"})\n",
    "chat_response = llm.invoke(formatted_prompt)\n",
    "parsed_output = StrOutputParser().invoke(chat_response.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "a07a40b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "To find which phones were in contact with phone `84795203656`, you can use the following Cypher query. This query assumes that `84795203656` is stored as an `identifier` in a node of type `Identifier`.\n",
      "\n",
      "```cypher\n",
      "MATCH (p:Identifier {identifier: '84795203656'})-[:CONTACT]->(contact:Identifier)\n",
      "RETURN contact.identifier AS ContactIdentifier\n",
      "```\n",
      "\n",
      "### Explanation:\n",
      "- `MATCH (p:Identifier {identifier: '84795203656'})-[:CONTACT]->(contact:Identifier)`: This part of the query matches the `Identifier` node with the specified `identifier` and finds all nodes it has a `CONTACT` relationship with.\n",
      "- `RETURN contact.identifier AS ContactIdentifier`: This returns the `identifier` property of each contact node, labeling it as `ContactIdentifier` in the result.\n"
     ]
    }
   ],
   "source": [
    "print(parsed_output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "5adb7876",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_chain = prompt | llm | (lambda msg: msg.content) | StrOutputParser()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "7151d141",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "To find every phone that has contacted the identifier `84795203656`, you can use the following Cypher query. This query assumes that the phone numbers are stored in nodes of type `Identifier` and that the `CONTACT` relationship connects these nodes:\n",
      "\n",
      "```cypher\n",
      "MATCH (caller:Identifier)-[:CONTACT]->(target:Identifier {identifier: '84795203656'})\n",
      "RETURN caller.identifier AS contacted_phone\n",
      "```\n",
      "\n",
      "This query matches all `Identifier` nodes (`caller`) that have a `CONTACT` relationship with the `Identifier` node having the identifier `84795203656` (`target`) and returns the identifiers of these calling phones.\n"
     ]
    }
   ],
   "source": [
    "print(cypher_chain.invoke({\"question\":\"Give me every phone who contacted 84795203656.\"}))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e39963bd",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo4j_env",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
